#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + enable_cilium_clusterwide_network_policy = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "asia-northeast3"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "dev-cluster"
      + network                                  = (known after apply)
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "portfogram-gke"
      + remove_default_node_pool                 = true
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = (known after apply)
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + gcs_fuse_csi_driver_config {
              + enabled = (known after apply)
            }

          + gke_backup_agent_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }

          + stateful_ha_config {
              + enabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = (known after apply)
          + enabled             = (known after apply)

          + auto_provisioning_defaults {
              + boot_disk_kms_key = (known after apply)
              + disk_size         = (known after apply)
              + disk_type         = (known after apply)
              + image_type        = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + service_account   = (known after apply)

              + management {
                  + auto_repair     = (known after apply)
                  + auto_upgrade    = (known after apply)
                  + upgrade_options = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + upgrade_settings {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                  + strategy        = (known after apply)

                  + blue_green_settings {
                      + node_pool_soak_duration = (known after apply)

                      + standard_rollout_policy {
                          + batch_node_count    = (known after apply)
                          + batch_percentage    = (known after apply)
                          + batch_soak_duration = (known after apply)
                        }
                    }
                }
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + cost_management_config {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + gateway_api_config {
          + channel = (known after apply)
        }

      + identity_service_config {
          + enabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
          + stack_type                    = "IPV4"

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = (known after apply)

          + cidr_blocks {
              + cidr_block = "0.0.0.0/0"
            }
        }

      + mesh_certificates {
          + enable_certificates = (known after apply)
        }

      + monitoring_config {
          + enable_components = (known after apply)

          + advanced_datapath_observability_config {
              + enable_metrics = (known after apply)
              + enable_relay   = (known after apply)
              + relay_mode     = (known after apply)
            }

          + managed_prometheus {
              + enabled = (known after apply)
            }
        }

      + node_config {
          + boot_disk_kms_key           = (known after apply)
          + disk_size_gb                = (known after apply)
          + disk_type                   = (known after apply)
          + effective_taints            = (known after apply)
          + enable_confidential_storage = (known after apply)
          + guest_accelerator           = (known after apply)
          + image_type                  = (known after apply)
          + labels                      = (known after apply)
          + local_ssd_count             = (known after apply)
          + logging_variant             = (known after apply)
          + machine_type                = (known after apply)
          + metadata                    = (known after apply)
          + min_cpu_platform            = (known after apply)
          + node_group                  = (known after apply)
          + oauth_scopes                = (known after apply)
          + preemptible                 = (known after apply)
          + resource_labels             = (known after apply)
          + resource_manager_tags       = (known after apply)
          + service_account             = (known after apply)
          + spot                        = (known after apply)
          + tags                        = (known after apply)

          + advanced_machine_features {
              + enable_nested_virtualization = (known after apply)
              + threads_per_core             = (known after apply)
            }

          + confidential_nodes {
              + enabled = (known after apply)
            }

          + containerd_config {
              + private_registry_access_config {
                  + enabled = (known after apply)

                  + certificate_authority_domain_config {
                      + fqdns = (known after apply)

                      + gcp_secret_manager_certificate_config {
                          + secret_uri = (known after apply)
                        }
                    }
                }
            }

          + ephemeral_storage_local_ssd_config {
              + local_ssd_count = (known after apply)
            }

          + fast_socket {
              + enabled = (known after apply)
            }

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + host_maintenance_policy {
              + maintenance_interval = (known after apply)
            }

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
              + pod_pids_limit       = (known after apply)
            }

          + linux_node_config {
              + cgroup_mode = (known after apply)
              + sysctls     = (known after apply)
            }

          + local_nvme_ssd_block_config {
              + local_ssd_count = (known after apply)
            }

          + reservation_affinity {
              + consume_reservation_type = (known after apply)
              + key                      = (known after apply)
              + values                   = (known after apply)
            }

          + secondary_boot_disks {
              + disk_image = (known after apply)
              + mode       = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + sole_tenant_config {
              + node_affinity {
                  + key      = (known after apply)
                  + operator = (known after apply)
                  + values   = (known after apply)
                }
            }

          + taint {
              + effect = (known after apply)
              + key    = (known after apply)
              + value  = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + location_policy      = (known after apply)
              + max_node_count       = (known after apply)
              + min_node_count       = (known after apply)
              + total_max_node_count = (known after apply)
              + total_min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + network_config {
              + create_pod_range     = (known after apply)
              + enable_private_nodes = (known after apply)
              + pod_ipv4_cidr_block  = (known after apply)
              + pod_range            = (known after apply)

              + network_performance_config {
                  + total_egress_bandwidth_tier = (known after apply)
                }

              + pod_cidr_overprovision_config {
                  + disabled = (known after apply)
                }
            }

          + node_config {
              + boot_disk_kms_key           = (known after apply)
              + disk_size_gb                = (known after apply)
              + disk_type                   = (known after apply)
              + effective_taints            = (known after apply)
              + enable_confidential_storage = (known after apply)
              + guest_accelerator           = (known after apply)
              + image_type                  = (known after apply)
              + labels                      = (known after apply)
              + local_ssd_count             = (known after apply)
              + logging_variant             = (known after apply)
              + machine_type                = (known after apply)
              + metadata                    = (known after apply)
              + min_cpu_platform            = (known after apply)
              + node_group                  = (known after apply)
              + oauth_scopes                = (known after apply)
              + preemptible                 = (known after apply)
              + resource_labels             = (known after apply)
              + resource_manager_tags       = (known after apply)
              + service_account             = (known after apply)
              + spot                        = (known after apply)
              + tags                        = (known after apply)

              + advanced_machine_features {
                  + enable_nested_virtualization = (known after apply)
                  + threads_per_core             = (known after apply)
                }

              + confidential_nodes {
                  + enabled = (known after apply)
                }

              + containerd_config {
                  + private_registry_access_config {
                      + enabled = (known after apply)

                      + certificate_authority_domain_config {
                          + fqdns = (known after apply)

                          + gcp_secret_manager_certificate_config {
                              + secret_uri = (known after apply)
                            }
                        }
                    }
                }

              + ephemeral_storage_local_ssd_config {
                  + local_ssd_count = (known after apply)
                }

              + fast_socket {
                  + enabled = (known after apply)
                }

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + host_maintenance_policy {
                  + maintenance_interval = (known after apply)
                }

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                  + pod_pids_limit       = (known after apply)
                }

              + linux_node_config {
                  + cgroup_mode = (known after apply)
                  + sysctls     = (known after apply)
                }

              + local_nvme_ssd_block_config {
                  + local_ssd_count = (known after apply)
                }

              + reservation_affinity {
                  + consume_reservation_type = (known after apply)
                  + key                      = (known after apply)
                  + values                   = (known after apply)
                }

              + secondary_boot_disks {
                  + disk_image = (known after apply)
                  + mode       = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + sole_tenant_config {
                  + node_affinity {
                      + key      = (known after apply)
                      + operator = (known after apply)
                      + values   = (known after apply)
                    }
                }

              + taint {
                  + effect = (known after apply)
                  + key    = (known after apply)
                  + value  = (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + placement_policy {
              + policy_name  = (known after apply)
              + tpu_topology = (known after apply)
              + type         = (known after apply)
            }

          + queued_provisioning {
              + enabled = (known after apply)
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
              + strategy        = (known after apply)

              + blue_green_settings {
                  + node_pool_soak_duration = (known after apply)

                  + standard_rollout_policy {
                      + batch_node_count    = (known after apply)
                      + batch_percentage    = (known after apply)
                      + batch_soak_duration = (known after apply)
                    }
                }
            }
        }

      + node_pool_auto_config {
          + resource_manager_tags = (known after apply)

          + network_tags {
              + tags = (known after apply)
            }
        }

      + node_pool_defaults {
          + node_config_defaults {
              + logging_variant = (known after apply)

              + containerd_config {
                  + private_registry_access_config {
                      + enabled = (known after apply)

                      + certificate_authority_domain_config {
                          + fqdns = (known after apply)

                          + gcp_secret_manager_certificate_config {
                              + secret_uri = (known after apply)
                            }
                        }
                    }
                }
            }
        }

      + notification_config {
          + pubsub {
              + enabled = (known after apply)
              + topic   = (known after apply)

              + filter {
                  + event_type = (known after apply)
                }
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + security_posture_config {
          + mode               = (known after apply)
          + vulnerability_mode = (known after apply)
        }

      + service_external_ips_config {
          + enabled = (known after apply)
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + workload_pool = (known after apply)
        }
    }

  # module.gke.google_container_node_pool.private_node_pool_1 will be created
  + resource "google_container_node_pool" "private_node_pool_1" {
      + cluster                     = "dev-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-northeast3"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "private-node-pool-1"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = [
          + "asia-northeast3-a",
        ]
      + operation                   = (known after apply)
      + project                     = "portfogram-gke"
      + version                     = (known after apply)

      + management {
          + auto_repair  = false
          + auto_upgrade = true
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + network_performance_config {
              + total_egress_bandwidth_tier = (known after apply)
            }

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "UBUNTU_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false

          + confidential_nodes {
              + enabled = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # module.gke.google_container_node_pool.private_node_pool_2 will be created
  + resource "google_container_node_pool" "private_node_pool_2" {
      + cluster                     = "dev-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-northeast3"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "private-node-pool-2"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = [
          + "asia-northeast3-b",
        ]
      + operation                   = (known after apply)
      + project                     = "portfogram-gke"
      + version                     = (known after apply)

      + management {
          + auto_repair  = false
          + auto_upgrade = true
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + network_performance_config {
              + total_egress_bandwidth_tier = (known after apply)
            }

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "UBUNTU_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false

          + confidential_nodes {
              + enabled = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # module.gke.google_container_node_pool.public_node_pool will be created
  + resource "google_container_node_pool" "public_node_pool" {
      + cluster                     = "dev-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-northeast3"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "public-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = [
          + "asia-northeast3-a",
        ]
      + operation                   = (known after apply)
      + project                     = "portfogram-gke"
      + version                     = (known after apply)

      + management {
          + auto_repair  = false
          + auto_upgrade = true
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + network_performance_config {
              + total_egress_bandwidth_tier = (known after apply)
            }

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "UBUNTU_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false

          + confidential_nodes {
              + enabled = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # module.network.google_compute_firewall.allow_external will be created
  + resource "google_compute_firewall" "allow_external" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "dev-portfogram-allow-external"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "portfogram-gke"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # module.network.google_compute_firewall.allow_internal will be created
  + resource "google_compute_firewall" "allow_internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "dev-portfogram-allow-internal"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "portfogram-gke"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/8",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "udp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.network.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "dev-portfogram-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "portfogram-gke"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.network.google_compute_router.nat_router will be created
  + resource "google_compute_router" "nat_router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "dev-portfogram-nat-router"
      + network            = (known after apply)
      + project            = "portfogram-gke"
      + region             = "asia-northeast3"
      + self_link          = (known after apply)
    }

  # module.network.google_compute_router_nat.nat_gw will be created
  + resource "google_compute_router_nat" "nat_gw" {
      + auto_network_tier                   = (known after apply)
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = (known after apply)
      + endpoint_types                      = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = (known after apply)
      + name                                = "dev-portfogram-nat-gw"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = "portfogram-gke"
      + region                              = "asia-northeast3"
      + router                              = "dev-portfogram-nat-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30
    }

  # module.network.google_compute_subnetwork.private_subnet will be created
  + resource "google_compute_subnetwork" "private_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "dev-portfogram-private-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "portfogram-gke"
      + purpose                    = (known after apply)
      + region                     = "asia-northeast3"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.network.google_compute_subnetwork.public_subnet will be created
  + resource "google_compute_subnetwork" "public_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "192.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "dev-portfogram-public-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "portfogram-gke"
      + purpose                    = (known after apply)
      + region                     = "asia-northeast3"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

*Pusher: @minina0407, Action: `pull_request`, Workflow: `Terraform CI/CD`*